Hey @VenelinMartinov 👋 Thank you for taking the time to raise this! I took a look over the issue and noted a couple of things, the first of which was that this was reproducible without the `-refresh=false` flag. The second bit was that the `provider_details` argument is a [`TypeMap` that's `Required`, not `Optional` and/or`Computed`](https://github.com/hashicorp/terraform-provider-aws/blob/238a3dfc902513b6c4936831f8029b3daaa154cf/internal/service/cognitoidp/identity_provider.go#L62-L66). With that in mind, if Terraform detects an upstream change that doesn't match the defined configuration, it will attempt to "correct" that drift. In this case, based on the [API documentation](https://docs.aws.amazon.com/cognito-user-identity-pools/latest/APIReference/API_CreateIdentityProvider.html#API_CreateIdentityProvider_RequestSyntax), the upstream API only expects `authorize_scopes`, `client_id`, and `client_secret` during creation/updates, but returns the additional values that are appearing in the planned change on read, leading to the perceived drift.

When I altered my configuration (by the way, thank you _very_ much for providing a sample configuration that could be applied without modifications -- that's incredibly helpful) to include the additional values, the upstream API didn't complain, and Terraform was able to create the resource without reporting a diff on later runs:

<details><summary>Updated configuration</summary>

```hcl
resource "aws_cognito_user_pool" "pool" {
  name = "my-user-pool"

  schema {
    name                = "email"
    required            = true
    attribute_data_type = "String"
  }

  password_policy {
    minimum_length    = 8
    require_uppercase = true
    require_lowercase = true
    require_numbers   = true
    require_symbols   = true
  }
}

resource "aws_cognito_identity_provider" "google" {
  user_pool_id  = aws_cognito_user_pool.pool.id
  provider_name = "Google"
  provider_type = "Google"

  provider_details = {
    client_id                     = "REDACTED"
    client_secret                 = "REDACTED"
    authorize_scopes              = "email profile openid"
    attributes_url                = "https://people.googleapis.com/v1/people/me?personFields="
    attributes_url_add_attributes = "true"
    authorize_url                 = "https://accounts.google.com/o/oauth2/v2/auth"
    oidc_issuer                   = "https://accounts.google.com"
    token_request_method          = "POST"
    token_url                     = "https://www.googleapis.com/oauth2/v4/token"
  }

  attribute_mapping = {
    email    = "email"
    username = "sub"
  }
}
```
</details>

<details><summary>Initial apply output</summary>

```console
$ terraform apply --auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cognito_identity_provider.google will be created
  + resource "aws_cognito_identity_provider" "google" {
      + attribute_mapping = {
          + "email"    = "email"
          + "username" = "sub"
        }
      + id                = (known after apply)
      + provider_details  = {
          + "attributes_url"                = "https://people.googleapis.com/v1/people/me?personFields="
          + "attributes_url_add_attributes" = "true"
          + "authorize_scopes"              = "email profile openid"
          + "authorize_url"                 = "https://accounts.google.com/o/oauth2/v2/auth"
          + "client_id"                     = "REDACTED"
          + "client_secret"                 = "REDACTED"
          + "oidc_issuer"                   = "https://accounts.google.com"
          + "token_request_method"          = "POST"
          + "token_url"                     = "https://www.googleapis.com/oauth2/v4/token"
        }
      + provider_name     = "Google"
      + provider_type     = "Google"
      + user_pool_id      = (known after apply)
    }

  # aws_cognito_user_pool.pool will be created
  + resource "aws_cognito_user_pool" "pool" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "my-user-pool"
      + sms_verification_message   = (known after apply)
      + tags_all                   = (known after apply)
      + user_pool_tier             = (known after apply)

      + admin_create_user_config (known after apply)

      + password_policy {
          + minimum_length                   = 8
          + require_lowercase                = true
          + require_numbers                  = true
          + require_symbols                  = true
          + require_uppercase                = true
          + temporary_password_validity_days = (known after apply)
        }

      + schema {
          + attribute_data_type = "String"
          + name                = "email"
          + required            = true
        }

      + sign_in_policy (known after apply)

      + sms_configuration (known after apply)

      + username_configuration (known after apply)

      + verification_message_template (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_cognito_user_pool.pool: Creating...
aws_cognito_user_pool.pool: Creation complete after 1s [id=us-east-1_LdjHzL0Zi]
aws_cognito_identity_provider.google: Creating...
aws_cognito_identity_provider.google: Creation complete after 0s [id=us-east-1_LdjHzL0Zi:Google]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```
</details>

<details><summary>Follow up plan output</summary>

```console
$ terraform plan
aws_cognito_user_pool.pool: Refreshing state... [id=us-east-1_LdjHzL0Zi]
aws_cognito_identity_provider.google: Refreshing state... [id=us-east-1_LdjHzL0Zi:Google]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
```
</details>

It's not quite clear to me whether this is a scenario that a [`DiffSuppressFunc`](https://developer.hashicorp.com/terraform/plugin/sdkv2/schemas/schema-behaviors) is appropriate for, so I'm going to leave this open for now, but I wanted to give you some kind of update with a workaround while this awaits prioritization.